let questions = [
  {
    "question": "1. 你做事是一個值得信賴的人嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "2. 你個性溫和嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "3. 你有活力嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "4. 你善解人意嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "5. 你獨立嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "6. 你受人愛戴嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "7. 做事認真且正直嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "8. 你富有同情心嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "9. 你有說服力嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "10. 你大膽嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "11. 你精確嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "12. 你適應能力強嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "13. 你組織能力好嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "14. 你是否積極主動？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "15. 你害羞嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "16. 你強勢嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "17. 你鎮定嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "18. 你勇於學習嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "19. 你反應快嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "20. 你外向嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "21. 你注意細節嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "22. 你愛說話嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "23. 你的協調能力好嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "24. 你勤勞嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "25. 你慷慨嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "26. 你小心翼翼嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "27. 你令人愉快嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "28. 你傳統嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "29. 你親切嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {
    "question": "30. 你工作足夠有效率嗎？",
    "answers": [
      ["5分", 5],
      ["4分", 4],
      ["3分", 3],
      ["2分", 2],
      ["1分", 1]
    ]
  },
  {}
];

let finalAnswers={
      "A":["愛情有點酸","在今年，你的愛情有一些酸哦，不過還好，不苦，而且有時候雖然酸，酸中也帶了絲甜。即使你會與喜歡的人沒有緣分走到一起，但是你們彼此能祝福對方。心中有些酸，是因為你看得開。現在對愛情真的看得淡了，不會強求，也不渴望什麼轟轟烈烈，甜甜蜜蜜，只希望過了這陣酸，會有甜頭來。"],
      "B":["愛情超級甜","在今年裡，你的愛情超級甜蜜哦，真的有如蜜糖一樣甜，不時撒一把狗糧，能讓旁邊的人都覺得發膩哦。當然啦，你這麼幸運，遇到甜蜜的愛情，也是因為你是一個溫暖的人啊，值得這麼好的愛情，也值得別人好好疼愛你。你也會加倍珍惜，好好回饋對方，這樣才是愛情的正確打開方式。"],
      "C":["愛情有苦有甜","你在今年的愛情，一定是有苦也有甜的，其實這才是正常的感情，或者說普通的感情。有的人一直甜蜜，他們是幸運兒。而你是普通人，感情中會有甜蜜的時候，也會有爭吵矛盾，會有淚水，會有痛苦。但是學會理智經營感情，在甜的時候好好享受，在苦的時候及時審視，愛情才能持久。"],
      "D":["愛情平淡沒滋味","今年裡，你的愛情沒有啥滋味，可能你根本就遇不到愛情，繼續又單身一整年，這樣也好，你可以忙於賺錢。也可能你的愛情就是有如一碗平平淡淡的白開水，沒有什麼滋味，但是沒有它又不行。或者是缺少了一些刺激，但是誰的愛情能一直轟轟烈烈呢？平淡如水，細水長流，未嘗不是一件好事。"]
};

// {
//   "question": "1. 你做事是一個值得信賴的人嗎？",
//   "answers": [
//     ["5分", 5],
//     ["4分", 4],
//     ["3分", 3],
//     ["2分", 2],
//     ["1分", 1]
//   ]
// },
// {
//   "question": "2. 你個性溫和嗎？",
//   "answers": [
//     ["5分", 5],
//     ["4分", 4],
//     ["3分", 3],
//     ["2分", 2],
//     ["1分", 1]
//   ]
// },
// {
//   "question": "2. 你個性溫和嗎？",
//   "answers": [
//     ["5分", 5],
//     ["4分", 4],
//     ["3分", 3],
//     ["2分", 2],
//     ["1分", 1]
//   ]
// },